from b00_interface import eval_test
from t28_diffie_hellman_ke import diffie_hellman_ke

# В данном тесте проверочный шифротекст не имеет значения
diffie_hellman_ke_testcases = [
    [
        '',
        0,
        {'g': 33113, 'p': 10729}
    ],
    [
        '',
        0,
        {
            'g': 508087017476997416462857871090656593822319355236851804525278743678130178823028129456065863405440024975040020567428600552392138299332496359161646152090169,
            'p': 12880632337385155296127049594356910112210398760057928993202010639427967738437640048197627383999180146204935556606601388191417966324049038094359373320403991
        }
    ],
]

if __name__ == '__main__':
    eval_test(diffie_hellman_ke, diffie_hellman_ke_testcases, ['kec', 'kee'])
